function [z_w T] = whiten(z)
%--------------------------------------------------------------------------
% 语法:z_w = myWhiten(z);
%     [z_w T] = myWhiten(z);
% 输入:z是一个mxn的矩阵，包含m维随机变量的各n个采样点。
% 输出:z_w是白化版本的z。T是mxm的白化变换矩阵。
%--------------------------------------------------------------------------
 
%% 计算样本协方差
R = cov(z'); % 1表示除以N来计算协方差
 
%% 白化z
[U D ~] = svd(R, 'econ'); % 用eig也行，[U, D] = eig(R);
 
%% 下面求白化矩阵
T = U * inv (sqrt(D)) * U'; % 称为协方差矩阵的逆均方根，inv计算不会太耗时间，因为D为对角阵。inv(sqrt(D))*U'也是一个可行白化矩阵
 
%% 乘以白化矩阵实现白化
z_w = T * z;